In [2]:
import pandas as pd
import numpy as np

In [60]:
raw_data = {'first_name': ['Gaurav', np.nan, 'Golu', 'Jaki', 'sweety'],
        'last_name': ['Harsola', np.nan, 'bhalia', 'tiwari', 'jain'],
        'age': [24, np.nan, 26, 24, 33],
        'sex': ['m', np.nan, 'f', 'm', 'f'],
        'preTestScore': [4, np.nan, np.nan, 2, 3],
        'postTestScore': [25, np.nan, np.nan, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'sex', 'preTestScore', 'postTestScore'])
df

  first_name last_name   age  sex  preTestScore  postTestScore
0     Gaurav   Harsola  24.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Golu    bhalia  26.0    f           NaN            NaN
3       Jaki    tiwari  24.0    m           2.0           62.0
4     sweety      jain  33.0    f           3.0           70.0

In [61]:
#Drop missing observations
df_no_missing = df.dropna()
df_no_missing

  first_name last_name   age sex  preTestScore  postTestScore
0     Gaurav   Harsola  24.0   m           4.0           25.0
3       Jaki    tiwari  24.0   m           2.0           62.0
4     sweety      jain  33.0   f           3.0           70.0

In [62]:
df_cleaned = df.dropna(how='all',axis=0)
df_cleaned

  first_name last_name   age sex  preTestScore  postTestScore
0     Gaurav   Harsola  24.0   m           4.0           25.0
2       Golu    bhalia  26.0   f           NaN            NaN
3       Jaki    tiwari  24.0   m           2.0           62.0
4     sweety      jain  33.0   f           3.0           70.0

In [63]:
#Fill in missing data with zeros
df.fillna(0
         )

  first_name last_name   age sex  preTestScore  postTestScore
0     Gaurav   Harsola  24.0   m           4.0           25.0
1          0         0   0.0   0           0.0            0.0
2       Golu    bhalia  26.0   f           0.0            0.0
3       Jaki    tiwari  24.0   m           2.0           62.0
4     sweety      jain  33.0   f           3.0           70.0

In [64]:
#Fill in missing in preTestScore with the mean value of preTestScore
#inplace=True means that the changes are saved to the df right away
df['preTestScore'].fillna(df['preTestScore'].mean(),inplace=True)
df

  first_name last_name   age  sex  preTestScore  postTestScore
0     Gaurav   Harsola  24.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           3.0            NaN
2       Golu    bhalia  26.0    f           3.0            NaN
3       Jaki    tiwari  24.0    m           2.0           62.0
4     sweety      jain  33.0    f           3.0           70.0

In [65]:
#groupby Sex and take mean of postTestScore on basis of groupby
df["postTestScore"].fillna(df.groupby("sex")["postTestScore"].mean(), inplace=True)
df

  first_name last_name   age  sex  preTestScore  postTestScore
0     Gaurav   Harsola  24.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           3.0            NaN
2       Golu    bhalia  26.0    f           3.0            NaN
3       Jaki    tiwari  24.0    m           2.0           62.0
4     sweety      jain  33.0    f           3.0           70.0

In [66]:
df[df['age'].notnull() & df['sex'].notnull()]

  first_name last_name   age sex  preTestScore  postTestScore
0     Gaurav   Harsola  24.0   m           4.0           25.0
2       Golu    bhalia  26.0   f           3.0            NaN
3       Jaki    tiwari  24.0   m           2.0           62.0
4     sweety      jain  33.0   f           3.0           70.0